In [2]:
#Series (시리즈)

import numpy as np
import pandas as pd

In [3]:
pd.Series([1,2,3,4]) #인덱스를 함께 가지고 옴

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
#인덱스 이름 변경
pd.Series([1,2,3,4], index=['a','b','c','d'])

a    1
b    2
c    3
d    4
dtype: int64

In [5]:
data = pd.Series([1,2,3,4], index=['a','b','c','d'])
data['b']

2

In [6]:
data = pd.Series([1,2,3,4], index=['a','b','c','d'], name='Title')

print(data)
data['c']

a    1
b    2
c    3
d    4
Name: Title, dtype: int64

3

In [7]:
#Serires >> dictionary로 변환 
population = {
	'korea' : 5180,
	'japan' : 12718,
	'china' : 141500,
	'usa' : 35676
}

print(population)

{'korea': 5180, 'japan': 12718, 'china': 141500, 'usa': 35676}

In [8]:
df_population = pd.Series(population)
print(df_population)

# dict(key : value) >> Series(idx, value)

korea      5180
japan     12718
china    141500
usa       35676
dtype: int64

In [9]:
#데이터프레임 (DataFrame)

gdp ={
	'korea' : 169320000,
	'japan' : 516700000,
	'china' : 1409250000,
	'usa' : 2041280000
}

print(gdp)

{'korea': 169320000, 'japan': 516700000, 'china': 1409250000, 'usa': 2041280000}

In [10]:
gdp = pd.Series(gdp)

print(gdp)

korea     169320000
japan     516700000
china    1409250000
usa      2041280000
dtype: int64

In [11]:
pd.DataFrame(gdp)

                0
korea   169320000
japan   516700000
china  1409250000
usa    2041280000

In [12]:
country = \
pd.DataFrame(
	{
		'population':population, 'gdp':gdp}
	
)

In [13]:
country

       population         gdp
korea        5180   169320000
japan       12718   516700000
china      141500  1409250000
usa         35676  2041280000

In [14]:
country.index

Index(['korea', 'japan', 'china', 'usa'], dtype='object')

In [15]:
country.columns

Index(['population', 'gdp'], dtype='object')

In [16]:
country['gdp']

korea     169320000
japan     516700000
china    1409250000
usa      2041280000
Name: gdp, dtype: int64

In [17]:
type(country['gdp'])

pandas.core.series.Series

In [18]:
#연산자 활용

print(country['gdp'])
print()
print(country['population'])

korea     169320000
japan     516700000
china    1409250000
usa      2041280000
Name: gdp, dtype: int64

korea      5180
japan     12718
china    141500
usa       35676
Name: population, dtype: int64

In [19]:
gdp_per_capital = country['gdp'] / country['population']
print(gdp_per_capital)

korea    32687.258687
japan    40627.457147
china     9959.363958
usa      57217.176814
dtype: float64

In [20]:
#새로 생성된 gdp_per_capital (1인 국민 총생산)


country['gdp_per_capital'] = gdp_per_capital #추가
print(country)

       population         gdp  gdp_per_capital
korea        5180   169320000     32687.258687
japan       12718   516700000     40627.457147
china      141500  1409250000      9959.363958
usa         35676  2041280000     57217.176814

In [21]:
#저장하기

country.to_csv("./country.csv")
#csv는 ,(comma)로 분리

In [22]:
country.to_excel('country.xlsx')

In [23]:
pd.read_csv("./country.csv")

  Unnamed: 0  population         gdp  gdp_per_capital
0      korea        5180   169320000     32687.258687
1      japan       12718   516700000     40627.457147
2      china      141500  1409250000      9959.363958
3        usa       35676  2041280000     57217.176814

In [24]:
pd.read_excel("./country.xlsx")

  Unnamed: 0  population         gdp  gdp_per_capital
0      korea        5180   169320000     32687.258687
1      japan       12718   516700000     40627.457147
2      china      141500  1409250000      9959.363958
3        usa       35676  2041280000     57217.176814

In [25]:
#indexing /slicing 
#.loc[행, 열], iloc[행,열]
country.loc['china']

population         1.415000e+05
gdp                1.409250e+09
gdp_per_capital    9.959364e+03
Name: china, dtype: float64

In [26]:
country.iloc[0] #iloc : 인덱스로 접근

population         5.180000e+03
gdp                1.693200e+08
gdp_per_capital    3.268726e+04
Name: korea, dtype: float64

In [27]:
country.iloc[1:3, :-1]

       population         gdp
japan       12718   516700000
china      141500  1409250000

In [28]:
#데이터프레임에 새 데이터 추가 및 수정 
#추가 : 리스트 또는 딕셔너리 추가 

df = pd.DataFrame(columns=['이름','나이','주소'])
df.loc[0] = ['홍길동','25','부산']
df.loc[1] = {'이름':'김철수','나이':'30','주소':'제주'}

df

    이름  나이  주소
0  홍길동  25  부산
1  김철수  30  제주

In [29]:
df.loc[1,'이름']

'김철수'

In [30]:
df['전화번호'] = np.nan

df.loc[0, '전화번호'] = '01012345679'

print(df)

    이름  나이  주소         전화번호
0  홍길동  25  부산  01012345679
1  김철수  30  제주          NaN

C:\Users\Master\AppData\Local\Temp\ipykernel_13708\60440889.py:3: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '01012345679' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df.loc[0, '전화번호'] = '01012345679'

In [31]:
df['이름']

0    홍길동
1    김철수
Name: 이름, dtype: object

In [32]:
df[['이름','나이']] #여러개의 열 리스트로 묶음

    이름  나이
0  홍길동  25
1  김철수  30

In [33]:
df[['나이','주소']]

   나이  주소
0  25  부산
1  30  제주

In [34]:
#결측치 처리 
print(df)
print()
print(df.isnull())

    이름  나이  주소         전화번호
0  홍길동  25  부산  01012345679
1  김철수  30  제주          NaN

      이름     나이     주소   전화번호
0  False  False  False  False
1  False  False  False   True

In [35]:
df.notnull()

     이름    나이    주소   전화번호
0  True  True  True   True
1  True  True  True  False

In [36]:
df.dropna() #널값없앰

    이름  나이  주소         전화번호
0  홍길동  25  부산  01012345679

In [37]:
df['전화번호'].fillna(0)

0    01012345679
1              0
Name: 전화번호, dtype: object

In [38]:
df

    이름  나이  주소         전화번호
0  홍길동  25  부산  01012345679
1  김철수  30  제주          NaN

In [39]:
df2 = df.copy()
df2.head()

    이름  나이  주소         전화번호
0  홍길동  25  부산  01012345679
1  김철수  30  제주          NaN

In [44]:
df2['전화번호'] =  df2['전화번호'].fillna(0)
print(df2)

    이름  나이  주소         전화번호
0  홍길동  25  부산  01012345679
1  김철수  30  제주            0

In [47]:

df['전화번호'] = df['전화번호'].fillna('전화번호없음')

In [48]:
df

    이름  나이  주소         전화번호
0  홍길동  25  부산  01012345679
1  김철수  30  제주            0

In [51]:
#Series 연산

A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])

print(A)
print()
print(B)
A + B
A.add(B, fill_value=0)

0    2
1    4
2    6
dtype: int64

1    1
2    3
3    5
dtype: int64

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [52]:
A = pd.DataFrame(np.random.randint(0, 10, (2, 2)), columns=list("AB"))
B = pd.DataFrame(np.random.randint(0, 10, (3, 3)), columns=list("BAC"))
A + B
A.add(B, fill_value=0)

      A     B    C
0  12.0  15.0  4.0
1   9.0   6.0  2.0
2   8.0   3.0  0.0

In [53]:
#집계함수

data = {
'A': [ i+5 for i in range(3) ],
'B': [ i**2 for i in range(3) ]
}
df = pd.DataFrame(data)
df['A'].sum() # 18
df.sum()
df.mean()

A    6.000000
B    1.666667
dtype: float64